kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
       vTaskDelay( pdMS_TO_TICKS(5000) );
    }
}
#endif //CONFIG_SOFTWARE_SENSOR_MHZ19C
#endif //CONFIG_SOFTWARE_EXTERNAL_UART_SUPPORT


#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
TaskHandle_t xClock;
static QueueHandle_t gpio_evt_clock_queue = NULL;
static QueueHandle_t gpio_evt_int_queue = NULL;
static void IRAM_ATTR gpio_clock_isr_handler(void* arg)
{
    uint32_t gpio_num = (uint32_t) arg;
    xQueueSendFromISR(gpio_evt_clock_queue, &gpio_num, NULL);
}

static void IRAM_ATTR gpio_int_isr_handler(void* arg)
{
    uint32_t gpio_num = (uint32_t) arg;
    xQueueSendFromISR(gpio_evt_int_queue, &gpio_num, NULL);
}

static void gpio_clock_task(void* arg)
{
#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
    bool bTm1637Init = false;
    DigitDisplay_t* digitdisplay_1;
    uint8_t listDisp_1[XDIGIT_DISPLAY_DIGIT_COUNT];
    Tm1637_Init();
    if (Tm1637_Enable(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN) == ESP_OK) {
        digitdisplay_1 = Tm1637_Attach(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN, BRIGHT_DARKEST, XDIGIT_DISPLAY_DIGIT_COUNT);
        bTm1637Init = true;
        Tm1637_ClearDisplay(digitdisplay_1);
    } else {
        ESP_LOGE(TAG, "Digit Display Tm1637_Enable Error");
    }
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT

    uint32_t io_num;
    for (;;) {
        if (xQueueReceive(gpio_evt_clock_queue, &io_num, portMAX_DELAY)) {
//            ESP_LOGI(TAG, "CLOCK GPIO[%"PRIu32"] intr, val: %d", io_num, gpio_get_level(io_num));
            rtc_date_t rtcdate;
            PCF8563_GetTime(&rtcdate);
#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
            if (bTm1637Init == true)
            {
                uint8_t hour10 = rtcdate.hour / 10;
                uint8_t hour01 = ( rtcdate.hour % 10 );
                uint8_t minute10 = rtcdate.minute / 10;
                uint8_t minute01 = ( rtcdate.minute % 10 );
                uint8_t second10 = rtcdate.second / 10;
                uint8_t second01 = ( rtcdate.second % 10 );
                listDisp_1[0] = hour10;
                listDisp_1[1] = hour01;
                listDisp_1[2] = minute10;
                listDisp_1[3] = minute01;
                listDisp_1[4] = second10;
                listDisp_1[5] = second01;
//                Tm1637_DisplayAll(digitdisplay_1, listDisp_1);
                Tm1637_DisplayClockDot(digitdisplay_1, listDisp_1);
            }
            else
            {
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
                ESP_LOGI(TAG, "%04d/%02d/%02d %02d:%02d:%02d", rtcdate.year, rtcdate.month, rtcdate.day, rtcdate.hour, rtcdate.minute, rtcdate.second);
#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
            }
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
        }
    }
}

static void gpio_int_task(void* arg)
{
    uint32_t io_num;
    for (;;) {
        if (xQueueReceive(gpio_evt_int_queue, &io_num, portMAX_DELAY)) {
            ESP_LOGI(TAG, "INT GPIO[%"PRIu32"] intr, val: %d", io_num, gpio_get_level(io_num));
        }
    }
}

void RtcInterruptInit()
{
    ESP_LOGI(TAG, "start RtcInterruptInit()");

    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.pin_bit_mask = ((1ULL<<PCF8563__CLOCK_PIN) | (1ULL<<PCF8563__INT_PIN));
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    gpio_evt_clock_queue = xQueueCreate(10, sizeof(uint32_t));
    gpio_evt_int_queue = xQueueCreate(10, sizeof(uint32_t));
    xTaskCreate(gpio_clock_task, "gpio_clock_task", 4096 * 1, NULL, 10, NULL);
    xTaskCreate(gpio_int_task, "gpio_int_task", 4096 * 1, NULL, 10, NULL);

    ESP_ERROR_CHECK(gpio_install_isr_service(0));
    ESP_ERROR_CHECK(gpio_isr_handler_add(PCF8563__CLOCK_PIN, gpio_clock_isr_handler, (void*) PCF8563__CLOCK_PIN));
    ESP_ERROR_CHECK(gpio_isr_handler_add(PCF8563__INT_PIN, gpio_int_isr_handler, (void*) PCF8563__INT_PIN));
    ESP_ERROR_CHECK(gpio_intr_enable(PCF8563__CLOCK_PIN));
    ESP_ERROR_CHECK(gpio_intr_enable(PCF8563__INT_PIN));
    ESP_ERROR_CHECK(gpio_set_intr_type(PCF8563__CLOCK_PIN, GPIO_INTR_NEGEDGE));
    ESP_ERROR_CHECK(gpio_set_intr_type(PCF8563__INT_PIN, GPIO_INTR_NEGEDGE));

}

void RtcStartClockInit()
{
    ESP_LOGI(TAG, "start RtcStartClockInit()");
#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT

    while (!PCF8563_isInitialized()) {
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }
    g_clockout_status = 1;
    PCF8563_ClockOutForTrimmer(g_clockout_status);
    ESP_LOGI(TAG, "PCF8563_ClockOutForTrimmer: %d", g_clockout_status);

#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
}

#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
TaskHandle_t xExternalRtc;
static bool g_timeInitialized = false;

static void time_sync_notification_cb(struct timeval *tv)
{
    ESP_LOGD(TAG, "Notification of a time synchronization event");
    g_timeInitialized = true;
}

void vExternal_rtc_task(void *pvParametes)
{
    //PCF8563
    ESP_LOGD(TAG, "start EXTERNAL Rtc");

    // Set timezone to Japan Standard Time
    setenv("TZ", "JST-9", 1);
    tzset();

    ESP_LOGD(TAG, "NTP ServerName:%s", CONFIG_NTP_SERVER_NAME);
    esp_sntp_setservername(0, CONFIG_NTP_SERVER_NAME);

    sntp_set_time_sync_notification_cb(time_sync_notification_cb);

    while (1) {
        if (wifi_isConnected() == ESP_OK) {
            esp_sntp_init();
        } else {
            vTaskDelay( pdMS_TO_TICKS(60000) );
            continue;
        }

        ESP_LOGD(TAG, "Waiting for time synchronization with SNTP server");
        while (!g_timeInitialized)
        {
            vTaskDelay( pdMS_TO_TICKS(5000) );
        }

        time_t now = 0;
        struct tm timeinfo = {0};
        time(&now);
        localtime_r(&now, &timeinfo);
        sprintf(g_lastSyncDatetime,"NTP Update : %04d/%02d/%02d %02d:%02d", timeinfo.tm_year+1900, timeinfo.tm_mon+1, timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min);
        ESP_LOGI(TAG, "%s", g_lastSyncDatetime);
#if CONFIG_SOFTWARE_UI_SUPPORT
        ui_status_set(g_lastSyncDatetime);
#endif //CONFIG_SOFTWARE_UI_SUPPORT

        if (PCF8563_isInitialized() == true)
        {
            rtc_date_t rtcdate;
            rtcdate.year = timeinfo.tm_year+1900;
            rtcdate.month = timeinfo.tm_mon+1;
            rtcdate.day = timeinfo.tm_mday;
            rtcdate.hour = timeinfo.tm_hour;
            rtcdate.minute = timeinfo.tm_min;
            rtcdate.second = timeinfo.tm_sec;
            PCF8563_SetTime(&rtcdate);
        }

