kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
        g_timeInitialized = false;
        esp_sntp_stop();
        vTaskDelay( pdMS_TO_TICKS(CONFIG_NTP_UPDATE_INTERVAL_TIME_MS) );
    }
}
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT

void vClock_task(void *pvParametes)
{
    //PCF8563
    ESP_LOGD(TAG, "start Clock");
 
    // Set timezone to Japan Standard Time
    setenv("TZ", "JST-9", 1);
    tzset();

    while (!PCF8563_isInitialized()) {
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }

    while (1) {
        rtc_date_t rtcdate;
        PCF8563_GetTime(&rtcdate);
#if CONFIG_SOFTWARE_CLOCK_SOUND_SUPPORT
        if (g_clockCurrent != rtcdate.hour) {
            if (rtcdate.hour == 0) { // 0:00
                g_clockCount = 12;
            } else if (rtcdate.hour > 12) { // 13:00-23:00
                g_clockCount = rtcdate.hour - 12;
            } else { // 1:00-12:00
                g_clockCount = rtcdate.hour;
            }
            g_clockCurrent = rtcdate.hour;
            vTaskResume(xSpeaker);
        }
#endif //CONFIG_SOFTWARE_CLOCK_SOUND_SUPPORT
        char str1[30] = {0};
        sprintf(str1,"%04d/%02d/%02d %02d:%02d:%02d", rtcdate.year, rtcdate.month, rtcdate.day, rtcdate.hour, rtcdate.minute, rtcdate.second);
#if CONFIG_SOFTWARE_UI_SUPPORT
        ui_datetime_set(str1);
#else
#if CONFIG_NTP_CLOCK_LOG_ENABLE
    ESP_LOGI(TAG, "%s", str1);
#endif //CONFIG_NTP_CLOCK_LOG_ENABLE
#endif //CONFIG_SOFTWARE_UI_SUPPORT

        vTaskDelay( pdMS_TO_TICKS(990) );
    }
}
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT


#if CONFIG_SOFTWARE_SENSOR_USE_SENSOR
#if (CONFIG_SOFTWARE_ESP_MQTT_SUPPORT != 1)
TaskHandle_t xSensorViewer;
void vSensor_Viewer_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start Sensor Viewer");
    vTaskDelay( pdMS_TO_TICKS(10000) );

    #if CONFIG_SOFTWARE_SENSOR_TYPE_TEMPERATURE
    g_sensor_mode += 1;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_HUMIDITY
    g_sensor_mode += 2;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_PRESSURE
    g_sensor_mode += 4;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_CO2
    g_sensor_mode += 8;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_LIGHT
    g_sensor_mode += 16;
    #endif

    while (1) {
        ESP_LOGD(TAG, "SENSOR mode %d", g_sensor_mode);
        switch (g_sensor_mode)
        {
        case 1:
            ESP_LOGI(TAG, "SENSOR temperature:%f", g_temperature);
            break;
        case 2:
            ESP_LOGI(TAG, "SENSOR humidity:%f", g_humidity);
            break;
        case 3:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f", g_temperature, g_humidity);
            break;
        case 4:
            ESP_LOGI(TAG, "SENSOR pressure:%f", g_pressure);
            break;
        case 5:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f", g_temperature, g_pressure);
            break;
        case 6:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f", g_humidity, g_pressure);
            break;
        case 7:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f", g_temperature, g_humidity, g_pressure);
            break;
        case 8:
            ESP_LOGI(TAG, "SENSOR CO2:%d", g_co2);
            break;
        case 9:
            ESP_LOGI(TAG, "SENSOR temperature:%f CO2:%d", g_temperature, g_co2);
            break;
        case 10:
            ESP_LOGI(TAG, "SENSOR humidity:%f CO2:%d", g_humidity, g_co2);
            break;
        case 11:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f CO2:%d", g_temperature, g_humidity, g_co2);
            break;
        case 12:
            ESP_LOGI(TAG, "SENSOR pressure:%f CO2:%d", g_pressure, g_co2);
            break;
        case 13:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f CO2:%d", g_temperature, g_pressure, g_co2);
            break;
        case 14:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f CO2:%d", g_humidity, g_pressure, g_co2);
            break;
        case 15:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f CO2:%d", g_temperature, g_humidity, g_pressure, g_co2);
            break;
        case 16:
            ESP_LOGI(TAG, "SENSOR lux:%u", g_lux);
            break;
        case 17:
            ESP_LOGI(TAG, "SENSOR temperature:%f lux:%u", g_temperature, g_lux);
            break;
        case 18:
            ESP_LOGI(TAG, "SENSOR humidity:%f lux:%u", g_humidity, g_lux);
            break;
        case 19:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f lux:%u", g_temperature, g_humidity, g_lux);
            break;
        case 20:
            ESP_LOGI(TAG, "SENSOR pressure:%f lux:%u", g_pressure, g_lux);
            break;
        case 21:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f lux:%u", g_temperature, g_pressure, g_lux);
            break;
        case 22:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f lux:%u", g_humidity, g_pressure, g_lux);
            break;
        case 23:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f lux:%u", g_temperature, g_humidity, g_pressure, g_lux);
            break;
        case 24:
            ESP_LOGI(TAG, "SENSOR CO2:%d lux:%u", g_co2, g_lux);
            break;
        case 25:
            ESP_LOGI(TAG, "SENSOR temperature:%f CO2:%d lux:%u", g_temperature, g_co2, g_lux);
            break;
        case 26:
            ESP_LOGI(TAG, "SENSOR humidity:%f CO2:%d lux:%u", g_humidity, g_co2, g_lux);
            break;
        case 27:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f CO2:%d lux:%u", g_temperature, g_humidity, g_co2, g_lux);
            break;
        case 28:
            ESP_LOGI(TAG, "SENSOR pressure:%f CO2:%d lux:%u", g_pressure, g_co2, g_lux);
            break;
        case 29:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f CO2:%d lux:%u", g_temperature, g_pressure, g_co2, g_lux);
            break;
        case 30:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f CO2:%d lux:%u", g_humidity, g_pressure, g_co2, g_lux);
            break;
        case 31:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f CO2:%d lux:%u", g_temperature, g_humidity, g_pressure, g_co2, g_lux);
            break;
        default:
            break;
        }

