kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
    wifi_initialise();
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT
    // I2C
    xTaskCreatePinnedToCore(&vExternal_i2c_task, "external_i2c_task", 4096 * 1, NULL, 2, &xExternalI2c, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_UART_SUPPORT
    // UART
    xTaskCreatePinnedToCore(&vExternal_uart_task, "external_uart_task", 4096 * 1, NULL, 2, &xExternalUart, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_UART_SUPPORT

#if CONFIG_SOFTWARE_INTERNAL_BUTTON_SUPPORT
    // BUTTON
    xTaskCreatePinnedToCore(&vInternal_button_task, "internal_button_task", 4096 * 1, NULL, 2, &xInternalButton, TASK_CORE);
#endif //CONFIG_SOFTWARE_INTERNAL_BUTTON_SUPPORT

#if CONFIG_SOFTWARE_SENSOR_USE_SENSOR
#if (CONFIG_SOFTWARE_ESP_MQTT_SUPPORT != 1)
    // SENSOR VIEWER
    xTaskCreatePinnedToCore(&vSensor_Viewer_task, "vSensor_Viewer_task", 4096 * 1, NULL, 2, &xSensorViewer, TASK_CORE);
#endif //(CONFIG_SOFTWARE_ESP_MQTT_SUPPORT != 1)
#endif //CONFIG_SOFTWARE_SENSOR_USE_SENSOR

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
    // rtc
    xTaskCreatePinnedToCore(&vExternal_rtc_task, "vExternal_rtc_task", 4096 * 1, NULL, 2, &xExternalRtc, TASK_CORE);
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
    // clock
    xTaskCreatePinnedToCore(&vClock_task, "clock_task", 4096 * 1, NULL, 2, &xClock, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT
    // EXTERNAL LED
    xTaskCreatePinnedToCore(&vExternal_led_task, "external_led_task", 4096 * 1, NULL, 2, &xExternalLED, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT
    // EXTERNAL BUTTON
    xTaskCreatePinnedToCore(&vExternal_button_task, "external_button_task", 4096 * 1, NULL, 2, &xExternalButton, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT

#if CONFIG_SOFTWARE_ESP_MQTT_SUPPORT
    // ESP_MQTT
    xTaskCreatePinnedToCore(&vEspMqttClient_task, "vEspMqttClient_task", 4096 * 1, NULL, 2, &xEspMqttClient, TASK_CORE);
#endif //CONFIG_SOFTWARE_ESP_MQTT_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT
    // EXTERNAL RGB LED BLINK
    xTaskCreatePinnedToCore(&vExternal_RGBLedBlink_task, "External_RGBLedBlink_task", 4096 * 1, NULL, 2, &xExternalRGBLedBlink, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT

#if CONFIG_HTTPS_OTA_SUPPORT
    // HTTPS OTA
    xTaskCreatePinnedToCore(&vHttpsOta_task, "HttpsOta_task", 4096 * 1, NULL, 2, &xHttpsOta, TASK_CORE);
#endif //CONFIG_HTTPS_OTA_SUPPORT

#if CONFIG_DEEP_SLEEP_SUPPORT
    // DEEP SLEEP
    /* Enable wakeup from deep sleep by rtc timer */
    deep_sleep_register_rtc_timer_wakeup();
#if CONFIG_DEEP_SLEEP_GPIO_WAKEUP
    deep_sleep_register_gpio_wakeup();
#endif //CONFIG_DEEP_SLEEP_GPIO_WAKEUP
    xTaskCreate(deep_sleep_task, "deep_sleep_task", 4096, NULL, 6, NULL);
#endif //CONFIG_DEEP_SLEEP_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
    // DIGIT DISPLAY
//    xTaskCreatePinnedToCore(&vDigitDisplayTask, "vDigitDisplayTask", 4096 * 1, NULL, 2, &xDigitDisplay, TASK_CORE);
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT

#if CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT
    // ADC
    xTaskCreate(&vMeasureOperationVoltageTask, "vMeasureOperationVoltageTask", 4096 * 1, NULL, 2, &xMeasureOperationVoltage);
#endif //CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT
}
